#(1)
a = [11,22,33,44,55,66,77]
for i in a:
    print(i) #11,22.33,55,66,77
    if i == 33:
        a.remove(i)
print(a) #[11, 22, 44, 55, 66, 77]

#循环的时候，33从列表中被删掉，后面的元素按顺序补足前面的位置，33原来的位置变成44，然后指针指向下一个位置，原来44的位置现在是55,44就被漏掉了
#(2)
a = [11,22,33,44,55,66,77]
for i in a:
    if i==33 or i==44:
        a.remove(i)
print(a) #[11, 22, 44, 55, 66, 77]
#33删掉之后，空出的位置被后面的按顺序补足，循环到下一个的时候，44的位置是55，就删不掉44

# 解决方法
a = [11,22,33,44,55,66,77]
b = []
for i in a:
    if i==33 or i ==44:
        b.append(i)
for i in b:
    a.remove(i)
print(a)